{
    "player": {
        "name": "Авантюрист",
        "max_hp": 20,
        "hp": 9,
        "stats": {
            "сила": 10,
            "ловкость": 10,
            "интеллект": 10
        },
        "inventory": {
            "items": [
                {
                    "name": "Зелье лечения",
                    "description": "Восстанавливает немного здоровья."
                },
                {
                    "name": "Старый меч",
                    "description": "Простой, но надежный меч."
                }
            ]
        }
    },
    "current_location": {
        "name": "Подземелье | Слизи | Сокровища",
        "tags": [
            "подземелье",
            "слизи",
            "сокровища"
        ],
        "description": "Воздух, пропитанный запахом гнили, тяжело висит над пульсирующей полупрозрачной слизью, что заполняет центр зала. В её студенистой толще виднеются костяные останки воина, всё ещё сжимающие рукоять инкрустированного драгоценностями меча — его блеск кажется зловещим приглашением. Густая, липкая паутина свисает с потолка погребальными саванами, цепляясь за влажные камни и саму поверхность дрожащей жижи, а из теней наверху доносится едва слышный хитиновый стрекот."
    },
    "game_state": "COMBAT",
    "short_term_memory": [
        "Начало боя в локации: Подземелье | Слизи | Сокровища.",
        "Игрок: 'Аванюрист медленно и осторожно продвигается вглубь'",
        "Результат: Твои шаги гулко раздаются в тишине подземелья. Осторожность не была лишней — боковым зрением ты замечаешь, как со сводчатого потолка срывается бесформенная капля. Это не вода. Студенистый комок шлепается на каменный пол прямо перед тобой и начинает пузыриться, обретая форму дрожащей, полупрозрачной слизи. Не успеваешь ты среагировать, как она выбрасывает в твою сторону едкий отросток, который обжигает ногу сквозь доспех.",
        "Игрок: 'Аванюрист сломя голову убегает!'",
        "Результат: Паника берет верх. Ты разворачиваешься и, не разбирая дороги, бросаешься бежать прочь по темному коридору. Позади раздается влажный шлепок — слизь, неспособная к быстрой погоне, выбрасывает в твою сторону еще один кислотный сгусток. Он попадает тебе в спину, прожигая ткань плаща и обжигая кожу. Ты спотыкаешься, но продолжаешь бег, оставляя вязкое чудовище позади... по крайней мере, на время. Звук его медленного, чавкающего движения все еще эхом отдается от стен.",
        "Игрок: 'Аванюрист пытается сокрыться за поворотом'",
        "Результат: Ты ныряешь за ближайший выступ скалы, прижимаясь к холодному камню и затаив дыхание. Сердце колотится в груди, отдаваясь гулом в ушах. Влажное, чавкающее шлепанье преследователя становится все громче... ближе... вот оно уже совсем рядом. Ты зажмуриваешься, ожидая неминуемого. Но шлепки не останавливаются. Они медленно проползают мимо твоего укрытия и начинают удаляться вглубь коридора. Похоже, впотьмах слизь тебя не заметила. Опасность миновала, по крайней мере, на этот раз.",
        "Игрок: 'Аванюрист садится за своим укрытием и отдыхает'",
        "Результат: Ты прислоняешься спиной к холодному, влажному камню, позволяя себе наконец выдохнуть. Чавкающие звуки удаляются, пока не затихают совсем в лабиринте коридоров. Адреналин отступает, и ты чувствуешь острую, жгучую боль в ноге и спине, там, где кислота слизи коснулась тебя. Ты в безопасности, но ранен. Вокруг царит напряженная тишина, нарушаемая лишь звуком капающей откуда-то сверху воды. У тебя есть минута, чтобы прийти в себя и решить, что делать дальше.",
        "Игрок: 'Авантюрист осматривает своё окружение'",
        "Результат: Ты осторожно выглядываешь из-за своего укрытия. Коридор впереди тонет во мраке, лишь слабый свет пробивается откуда-то сверху, выхватывая из темноты груды обвалившихся камней и мусора. Внезапно тишину нарушает сухой, скрежещущий звук. В нескольких метрах от тебя, в куче старых костей и щебня, что-то начинает шевелиться. С жутким костяным стуком из обломков поднимается человеческая фигура. Пустые глазницы черепа вспыхивают тусклым, неживым светом. Скелет-страж, сжимая в костяной руке ржавый короткий меч, поворачивается в твою сторону и делает первый шаркающий шаг, готовый к бою."
    ]
}